#include "wy_headfile.h"


//uchar TrigFlag = 1;						  	// 超声波传感器触发标志位
u32 UlTansferTime = 0;                   		// 采集到的高电平时间
u32 UlCurDistance = 0;                   		// 当前距离


//-------------------------------------------------------------------------------------------------------------------
//  @brief    	超声波触发发送函数
//  @param
//  @param
//  @return     void
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void TrigUl(void)
{
    TRIG = 0;
    TRIG = 1;							// 测距触发信号的发送
    delay_us(15);
    TRIG = 0;
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief    	超声波获取物距
//  @param
//  @param
//  @return     void
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void UlGetDistance(void)
{
    TrigUl();										// 触发超声波传感器
	delay_ms(10);
	UlTansferTime = GetCaptureTime();				// 统计高电平时间		
    UlCurDistance = UlTansferTime * 1.7 / 100;  	// 转换为厘米
//	LCD_ShowChar(30,250,'1',16,0);
}
